var p = [{
		id: '1',
		value: '安徽',
		childs: [{
				value: "合肥市"
			},
			{
				value: "芜湖市"
			},
			{
				value: "蚌埠市"
			},
			{
				value: "淮南市"
			},
			{
				value: "马鞍山市"
			},
			{
				value: "淮北市"
			},
			{
				value: "铜陵市"
			},
			{
				value: "安庆市"
			},
			{
				value: "黄山市"
			},
			{
				value: "滁州市"
			},
			{
				value: "阜阳市"
			},
			{
				value: "宿州市"
			},
			{
				value: "巢湖市"
			},
			{
				value: "六安市"
			},
			{
				value: "亳州市"
			},
			{
				value: "池州市"
			},
			{
				value: "宣城市"
			}
		]
	},
	{
		id: '2',
		value: '北京',
		child: {
			value: "北京市"
		}
	}, {
		id: '3',
		value: '重庆',
		child: {
			value: "重庆市"
		}
	}, {
		id: '4',
		value: '福建',
		childs: [{
				value: "福州市"
			},
			{
				value: "厦门市"
			},
			{
				value: "莆田市"
			},
			{
				value: "三明市"
			},
			{
				value: "泉州市"
			},
			{
				value: "漳州市"
			},
			{
				value: "南平市"
			},
			{
				value: "龙岩市"
			},
			{
				value: "宁德市"
			}
		]
	},
	{
		id: '5',
		value: '甘肃',
		childs: [{
				value: "兰州市"
			} {
				value: "嘉峪关市"
			} {
				value: "金昌市"
			} {
				value: "白银市"
			} {
				value: "天水市"
			} {
				value: "武威市"
			} {
				value: "张掖市"
			} {
				value: "平凉市"
			} {
				value: "酒泉市"
			} {
				value: "庆阳市"
			} {
				value: "定西市"
			} {
				value: "陇南市"
			} {
				value: "临夏回族"
			},
			{
				value: "甘南藏族自治州"
			}
		]
	}, {
		id: '6',
		value: '广东',
		childs: [{
				value: "广州市"
			},
			{
				value: "深圳市"
			},
			{
				value: "珠海市"
			},
			{
				value: "汕头市"
			},
			{
				value: "韶关市"
			},
			{
				value: "佛山市"
			},
			{
				value: "江门市"
			},
			{
				value: "湛江市"
			},
			{
				value: "茂名市"
			},
			{
				value: "肇庆市"
			},
			{
				value: "惠州市"
			},
			{
				value: "梅州市"
			},
			{
				value: "汕尾市"
			},
			{
				value: "河源市"
			},
			{
				value: "阳江市"
			},
			{
				value: "清远市"
			},
			{
				value: "东莞市"
			},
			{
				value: "中山市"
			},
			{
				value: "潮州市"
			},
			{
				value: "揭阳市"
			},
			{
				value: "云浮市"
			}
		]
	}, {
		id: '7',
		value: '广西',
		childs: [{
				value: "南宁市"
			},
			{
				value: "柳州市"
			},
			{
				value: "桂林市"
			},
			{
				value: "梧州市"
			},
			{
				value: "北海市"
			},
			{
				value: "防城港市"
			},
			{
				value: "钦州市"
			},
			{
				value: "贵港市"
			},
			{
				value: "玉林市"
			},
			{
				value: "百色市"
			},
			{
				value: "贺州市"
			},
			{
				value: "河池市"
			},
			{
				value: "来宾市"
			},
			{
				value: "崇左市"
			}
		]
	}, {
		id: '8',
		value: '贵州',
		childs: [{
				value: "贵阳市"
			},
			{
				value: "六盘水市"
			},
			{
				value: "遵义市"
			},
			{
				value: "安顺市"
			},
			{
				value: "铜仁地区"
			},
			{
				value: "黔西南布依族苗族自治州"
			},
			{
				value: "毕节地区"
			},
			{
				value: "黔东南苗族侗族自治州"
			},
			{
				value: "黔南布依族苗族自治州"
			}
		]
	},
	{
		id: '9',
		value: '海南',
		childs: [{
				value: "海口市"
			},
			{
				value: "三亚市"
			}
		]
	}, {
		id: '10',
		value: '河北',
		childs: [{
				value: "石家庄市"
			},
			{
				value: "唐山市"
			},
			{
				value: "秦皇岛市"
			},
			{
				value: "邯郸市"
			},
			{
				value: "邢台市"
			},
			{
				value: "保定市"
			},
			{
				value: "张家口市"
			},
			{
				value: "承德市"
			},
			{
				value: "沧州市"
			},
			{
				value: "廊坊市"
			},
			{
				value: "衡水市"
			}
		]
	}, {
		id: '11',
		value: '河南',
		childs: [{
				value: "郑州市"
			},
			{
				value: "开封市"
			},
			{
				value: "洛阳市"
			},
			{
				value: "平顶山市"
			},
			{
				value: "安阳市"
			},
			{
				value: "鹤壁市"
			},
			{
				value: "新乡市"
			},
			{
				value: "焦作市"
			},
			{
				value: "濮阳市"
			},
			{
				value: "许昌市"
			},
			{
				value: "漯河市"
			},
			{
				value: "三门峡市"
			},
			{
				value: "南阳市"
			},
			{
				value: "商丘市"
			},
			{
				value: "信阳市"
			},
			{
				value: "周口市"
			},
			{
				value: "驻马店市"
			}
		]
	}, {
		id: '12',
		value: '黑龙江',
		childs: [{
				value: "哈尔滨市"
			},
			{
				value: "齐齐哈尔市"
			},
			{
				value: "鸡西市"
			},
			{
				value: "鹤岗市"
			},
			{
				value: "双鸭山市"
			},
			{
				value: "大庆市"
			},
			{
				value: "伊春市"
			},
			{
				value: "佳木斯市"
			},
			{
				value: "七台河市"
			},
			{
				value: "牡丹江市"
			},
			{
				value: "黑河市"
			},
			{
				value: "绥化市"
			},
			{
				value: "大兴安岭地区"
			}
		]
	},
	{
		id: '13',
		value: '湖北',
		childs: [{
				value: "武汉市"
			},
			{
				value: "黄石市"
			},
			{
				value: "十堰市"
			},
			{
				value: "宜昌市"
			},
			{
				value: "襄樊市"
			},
			{
				value: "鄂州市"
			},
			{
				value: "荆门市"
			},
			{
				value: "孝感市"
			},
			{
				value: "荆州市"
			},
			{
				value: "黄冈市"
			},
			{
				value: "咸宁市"
			},
			{
				value: "随州市"
			},
			{
				value: "恩施土家族苗族自治州"
			},
			{
				value: "神农架"
			}
		]
	}, {
		id: '14',
		value: '湖南',
		childs: [{
				value: "长沙市"
			},
			{
				value: "株洲市"
			},
			{
				value: "湘潭市"
			},
			{
				value: "衡阳市"
			},
			{
				value: "邵阳市"
			},
			{
				value: "岳阳市"
			},
			{
				value: "常德市"
			},
			{
				value: "张家界市"
			},
			{
				value: "益阳市"
			},
			{
				value: "郴州市"
			},
			{
				value: "永州市"
			},
			{
				value: "怀化市"
			},
			{
				value: "娄底市"
			},
			{
				value: "湘西土家族苗族自治州"
			}

		]
	}, {
		id: '15',
		value: '吉林',
		childs: [
			{value:"长春市"},
			{value:"吉林市"},
			{value:"四平市"},
			{value:"通化市"},
			{value:"白山市"},
			{value:"松原市"},
			{value:"白城市"},
			{value:"延边朝鲜族自治州"}
		]
	}, {
		id: '16',
		value: '江苏',
		childs: [

		]
	},
	{
		id: '17',
		value: '江西',
		childs: [

		]
	}, {
		id: '18',
		value: '辽宁',
		childs: [

		]
	}, {
		id: '19',
		value: '内蒙',
		childs: [

		]
	}, {
		id: '20',
		value: '宁夏',
		childs: [

		]
	},
	{
		id: '21',
		value: '青海',
		childs: [

		]
	}, {
		id: '22',
		value: '山东',
		childs: [

		]
	}, {
		id: '23',
		value: '山西',
		childs: [

		]
	}, {
		id: '24',
		value: '陕西',
		childs: [

		]
	},
	{
		id: '25',
		value: '上海',
		childs: [

		]
	}, {
		id: '26',
		value: '四川',
		childs: [

		]
	}, {
		id: '27',
		value: '天津',
		childs: [

		]
	}, {
		id: '28',
		value: '西藏',
		childs: [

		]
	},
	{
		id: '29',
		value: '新疆',
		childs: [

		]
	}, {
		id: '30',
		value: '云南',
		childs: [

		]
	}, {
		id: '31',
		value: '浙江',
		childs: [

		]
	}
];

var c =


	var provinces = {

			"黑龙江": [],
			"湖北": [],
			"湖南": []
		},
		"J": {
			"吉林": [],
			"江苏": ["南京市", "无锡市", "徐州市", "常州市", "苏州市", "南通市", "连云港市", "淮安市", "盐城市", "扬州市", "镇江市", "泰州市", "宿迁市"],
			"江西": ["南昌市", "景德镇市", "萍乡市", "九江市", "新余市", "鹰潭市", "赣州市", "吉安市", "宜春市", "抚州市", "上饶市"]
		},
		"L": {
			"辽宁": ["沈阳市", "大连市", "鞍山市", "抚顺市", "本溪市", "丹东市", "锦州市", "营口市", "阜新市", "辽阳市", "盘锦市", "铁岭市", "朝阳市", "葫芦岛市"]
		},
		"N": {
			"内蒙古": ["呼和浩特市", "包头市", "乌海市", "赤峰市", "通辽市", "鄂尔多斯市", "呼伦贝尔市", "巴彦淖尔市", "乌兰察布市", "兴安盟", "锡林郭勒盟", "阿拉善盟"],
			"宁夏": ["银川市", "石嘴山市", "吴忠市", "固原市", "中卫市"]
		},
		"Q": {
			"青海": ["西宁市", "海东地区", "海北藏族自治州", "黄南藏族自治州", "海南藏族自治州", "果洛藏族自治州", "玉树藏族自治州", "海西蒙古族藏族自治州"]
		},
		"S": {
			"山东": ["济南市", "青岛市", "淄博市", "枣庄市", "东营市", "烟台市", "潍坊市", "济宁市", "泰安市", "威海市", "日照市", "莱芜市", "临沂市", "德州市", "聊城市",
				"滨州市", "菏泽市"
			],
			"山西": ["太原市", "大同市", "阳泉市", "长治市", "晋城市", "朔州市", "晋中市", "运城市", "忻州市", "临汾市", "吕梁市"],
			"陕西": ["西安市", "铜川市", "宝鸡市", "咸阳市", "渭南市", "延安市", "汉中市", "榆林市", "安康市", "商洛市"],
			"上海": ["上海市"],
			"四川": ["成都市", "自贡市", "攀枝花市", "泸州市", "德阳市", "绵阳市", "广元市", "遂宁市", "内江市", "乐山市", "南充市", "眉山市", "宜宾市", "广安市", "达州市",
				"雅安市", "巴中市", "资阳市", "阿坝藏族羌族自治州", "甘孜藏族自治州", "凉山彝族自治州"
			]
		},
		"T": {
			"天津": ["天津市"]
		},
		"X": {
			"西藏": ["拉萨市", "昌都地区", "山南地区", "日喀则地区", "那曲地区", "阿里地区", "林芝地区"],
			"新疆": ["乌鲁木齐市", "克拉玛依市", "吐鲁番地区", "哈密地区", "昌吉回族自治州", "博尔塔拉蒙古自治州", "巴音郭楞蒙古自治州", "阿克苏地区", "克孜勒苏柯尔克孜自治州", "喀什地区",
				"和田地区", "伊犁哈萨克自治州", "塔城地区", "阿勒泰地区", "石河子市", "阿拉尔市", "图木舒克市", "五家渠市"
			]
		},
		"Y": {
			"云南": ["昆明市", "曲靖市", "玉溪市", "保山市", "昭通市", "丽江市", "思茅市", "临沧市", "楚雄彝族自治州", "红河哈尼族彝族自治州", "文山壮族苗族自治州", "西双版纳傣族自治州",
				"大理白族自治州", "德宏傣族景颇族自治州", "怒江傈僳族自治州", "迪庆藏族自治州"
			]
		},
		"Z": {
			"浙江": ["杭州市", "宁波市", "温州市", "嘉兴市", "湖州市", "绍兴市", "金华市", "衢州市", "舟山市", "台州市", "丽水市"]
		}
};
